[CFMain]
MemoryLoadTool="Memory Loader Tools"
LanguageSelect="Language"
ENG="English"
JPN="Japanese"
UpLoad="Upload (Display->USB)"
UpLoadQ="Upload\nDisplay->USB"
DownLoad="Download (USB->Display)"
DownLoadQ="Download\nUSB->Display"
Menu="Menu"
Exit="Exit"
VerFix="Ver."
Ver=""

[CFMenu]
MemoryLoadMenu="Memory Loader Tool Menu"
UpLoad="Upload (Display->USB)"
DownLoad="Download (USB->Display)"
SysInfo="System Information"
SysInfoQ="System Information"
Comp="Compare InternalData to USBStorage"
CompQ="Compare Data"
FileView="View USB Storage files"
FileViewQ="ListFile"
Back="Back"
Exit="Exit"


[CFUpLoad]
MemoryLoadTitle="Upload (Display->USB)"
Coution="Warning: Data in the USB Storage will be lost."
CoutionQ1="Warning:"
CoutionQ2="Data in the USB Storage will be lost."
PathFix="Path Name:"
Path=""
FileFix="File Name:"
FileName=""
PassFix="Password:"
PassFixQ="？"
Pass=""
Message="Please input the password and press the Start switch."
MessageQ1="Please input the password and"
MessageQ2="press the Start switch."
Start="Start"
FolderSelect="Select Folder"
FolderSelectQ="Folder"
NewFile="New File"
NewFileQ="New File"
FileSelect="Select File"
FileSelectQ="File"
Back="Back"
NoPasswordQ1=Password not set.
NoPasswordQ2=
NoPasswordFixQ=
Announce=""


[CFDownLoad]
MemoryLoadTitle="Download (USB->Display)"
Coution="Warning: Data in the internal memory will be lost."
CoutionQ1="Warning:"
CoutionQ2="Data in the internal memory"
CoutionQ3="will be lost."
FileFix="Path Name:"
FileName=""
PassFix="Password:"
PassFixQ="？"
Pass=""
Message="Please input the password and press the Start switch."
MessageQ1="Please input the password and"
MessageQ2="press the Start switch."
Start="Start"
FileSelect="Select File"
FileSelectQ="Select File"
Back="Back"
NoPasswordQ1=Password not set.
NoPasswordQ2=
NoPasswordFixQ=
Announce=""

[FileSelect]
MemoryLoadTitle="Select File"
MemoryLoadTitleQ="File List"
FileFix="Current File Name:"
FileFixQ="File:"
FileName=""
ViewFileName="File Name"
ViewFileNameQ="File Name"
ViewSize="Size"
ViewTime="Time Stamp"
FreeSpaceOfCF="USBStorageFreeSpace:"
FreeSpaceOfCFQ="Free Space:"
CFFreeSpaceSize=""
CFkb="kbytes"
FileInfo="File Info"
Kind="Model Name"
KindName=""
Comment="Comment"
CommentMsg=""
PagePrev=""
ViewTop="≪"
ViewUp="＜"
ViewDown="＞"
ViewBottom="≫"
PageBack=""
Enter="Enter"
Info="Details"
Back="Back"
ReName="Rename"
ReNameQ="Change"
Delete="Delete"
Copy="Copy"



[SysInfo]
MemoryLoadTitle="System Information (Internal Data)"
MemoryLoadTitleQ="System Information"
MemoryLoadTitleQ2="(Internal Data)"
System="[System Information]"
Cologne1=":"
Cologne2=":"
Kind="Model Name　　　　　 　"
KindName=""
FameVar="OS Version       "
FameVarQ="OS Ver       "
FameName=""
RuntimeVar="Runtime Version　    　"
RuntimeVarQ="Runtime Ver　    　"
RuntimeName=""
Protcol1="Driver Version"
Protcol1Q="Driver Ver"
Protcol2="　　　　　　　　　　　"
ProtcolName1=""
ProtcolName2=""
ProtcolName3=""
ProtcolName4=""
Iodriver1="I/O Driver Version"
Iodriver1Q="I/O Driver Ver"
IodriverName1=""
IodriverName2=""
IodriverName3=""
IodriverName4=""
DevMonVer="Device Monitor Version "
DevMonVerQ="Device Monitor Version "
DevMonVerName=""
Disp="[Project Information]"
SoftVar="Editor Version"
SoftVarQ="Editor Ver"
SoftName=""
PrjFile="Project File Name"
PrjFileQ="Project File Name"
PrjFileName=""
PrjDate="Date"
PrjDateName=""
PrjComment="Comment　"
PrjCommentQ="Comment　"
PrjCommentName=""
Size="[Backup Data Size]"
SizeQ="[Backup Data Size]"
SizeQ2="Size"
Strage="Storage "
StrageS="Internal Storage Size"
StrageSize=""
NorRom="NOR ROM"
NorRomS="NOR ROM Size"
NorRomSize=""
Sram=  "SRAM"
SramS=  "SRAM Size"
SramSize=""
Total= "Total"
TotalS= "Total Size"
TotalSize=""
FileNameFix="Backup File Name　"
FileName=""
DateFix="Date"
Date=""
Time=""
CFInfo="USB Info"
CFInfoQ="USB"
Return="Previous Page"
Next="Next Page"
Return2="Previous Page"
Next2="Next Page"
Back="Back"


[CFInfo]
MemoryLoadTitle="System Information (USB Data)"
MemoryLoadTitleQ="System Information"
MemoryLoadTitleQ2="(USB Data)"
System="[System Information]"
Cologne1=":"
Cologne2=":"
Kind="Model Name　　　　　　　　"
KindName=""
FameVar="OS Version"
FameVarQ="OS Ver"
FameName=""
RuntimeVar="Runtime Version　　"
RuntimeVarQ="Runtime Ver　　"
RuntimeName=""
Protcol1="Driver Version　　　　　"
Protcol1Q="Driver Ver　　　　　"
Protcol2="　　　　　　　　　　　　"
ProtcolName1=""
ProtcolName2=""
ProtcolName3=""
ProtcolName4=""
Iodriver1="I/O Driver Version　　　　　"
Iodriver1Q="I/O Driver Ver　　　　　"
IodriverName1=""
IodriverName2=""
IodriverName3=""
IodriverName4=""
DevMonVer="Device Monitor Version "
DevMonVerQ="Device Monitor Version "
DevMonVerName=""
Disp="[Project Information]"
SoftVar="Editor Version　"
SoftVarQ="Editor Ver　"
SoftName=""
PrjFile="Project File Name"
PrjFileQ="Project File Name"
PrjFileName=""
PrjDate="Date　　　"
PrjDateName=""
PrjComment="Comment　"
PrjCommentQ="Comment　"
PrjCommentName=""
Size="[Backup Data Size]"
SizeQ="[Backup Data Size]"
SizeQ2="Size"
Strage="Storage "
StrageS="Internal Storage Size"
StrageSize=""
NorRom="NOR ROM"
NorRomS="NOR ROM Size"
NorRomSize=""
Sram=  "SRAM"
SramS=  "SRAM Size"
SramSize=""
Total= "Total "
TotalS= "Total Size"
TotalSize=""
FileNameFix="Backup File Name　"
FileName=""
DateFix="Date"
Date=""
Time=""
SysInfo="Internal Info"
SysInfoQ="Internal"
Return="Previous Page"
Next="Next Page"
Return2="Previous Page"
Next2="Next Page"
Back="Back"


[Copy]
MemoryLoadTitle="Copy File"
CopyMoto="Copy Source"
CopyMotoQ="Copy Src"
CopySaki="Copy Destination"
CopySakiQ="Copy Dst"
PathFix="Path Name"
Path=""
FailFix="File Name"
FileName=""
FileNameDst=""
Colon=":"
Announce=""
FolderSelect="Select Folder"
Enter="Enter"
Change="Change"
Back="Back"


[Delete]
MemoryLoadTitle="Delete File"
Coution="Warning: Data in the USB Storage will be lost."
CoutionQ1="Warning:"
CoutionQ2="Data in the USB Storage will be lost."
FileFix="File Name:"
FileName=""
Message="Are you sure to delete the file?"
Announce=""
Yes="YES"
No="NO"
Back="Back"


[FileName]
MemoryLoadTitle="Input File Name"
MemoryLoadTitleQ="Input File Name"
PathFix="Path Name:"
Path=""
Message="Please input the filename and push the decision switch. "
FileFix="New File Name:"
FileFixQ="File Name:"
FileName=""
Enter="Enter"
Back="Back"


[FileComp]
MemoryLoadTitle="Compare Internal Data to USB Storage"
FileFix="File Name:"
FileName=""
Message="Please press the Start switch."
Bigin="Start"
ViewName="Mismatch List"
ViewFileName="Name"
FileSelect="Select File"
FileSelectQ="File"
Up="▲"
Down="▼"
Back="Back"

[@Message]
TITLE="Message"
YES="Yes"
NO="No"
OK="Ok"
CANCEL="Cancel"
Upload="Do you want to upload the data？"
Download="Do you want to download the data?"
ExitSystem="Are you sure to restart the system?"
OverWrite="Are you sure to overwrite the data?"
CautionNpxFile="NPX file exists in the display unit. Overwrite?"

[@ErrMessage]
TITLE="ErrMessage"
YES="Yes"
NO="No"
OK="Ok"
CANCEL="Cancel"
ER_STOPCOMPARE="The no. of mismatches exceeded %d. Comparison aborted."
ER_BADBACKUPFILE="Illegal backup file."
ER_FILENAME="Please input a file name."
ER_BASEBOARDID="Incorrect model."
ER_IOBOARDID="Incorrect Internal I/O Board type."
ER_NG_CF=The USB storage location not found.
ER_NG_SIZE=Cannot write to USB storage.
ER_NG_READ=USB storage data error.
ER_RETURN=Please push the Back button.
ER_NG_FAITAL=System Error
ER_NG_DRAMSMALL="There are features unsupported by this model."

[Announce]
ER_FILENAME=Please input a file name.
ER_FILEEXIST=The file does not exist.
ER_FILEDEL=Failed to delete the file.
ER_FILECOPY=Failed to copy the file.
ER_NG_CF=The USB storage location not found.
ER_NG_SIZE=Cannot write to USB storage.
ER_NG_READ=USB storage data error.
ER_NG_FAITAL=System Error
CP_FILECOPY=Executing File Copy
ER_PASSWORD=Incorrect password.
ER_PATHLEN=The path name is too long.
UP_READ_AGP=Reading data on the display unit...
UP_WRITE_NOR=Reading OS data…
UP_WRITE_NOR_END=OS data read completed.
UP_WRITE_NAND=Reading system/project data...
UP_WRITE_NAND_END=System/Project data read completed.
UP_WRITE_SRAM=Reading SRAM data…
UP_WRITE_SRAM_END=SRAM data read completed.
UP_OK_END=Successfully completed.
UP_NG_END=Abnormally terminated.
DW_WRITE_NOR_START=Initializing OS data
DW_WRITE_NOR=Writing OS data...(%d/%d)
DW_WRITE_NOR_END=OS data write completed (%d/%d).
DW_WRITE_NAND_START=Initializing system/project data
DW_WRITE_NAND=Writing system/project data...(%d/%d)
DW_WRITE_NAND_END=System/Project data write completed (%d/%d).
DW_WRITE_SRAM_START=Initializing SRAM data
DW_WRITE_SRAM=Writing SRAM data...(%d/%d)
DW_WRITE_SRAM_END=SRAM data write completed (%d/%d).
DW_OK_END=Successfully completed.
DW_NG_END=Abnormally terminated.
CMP_NORLOAD=Searching for OS data
CMP_NOR=Comparing OS data…(%d/%d)
CMP_NOREND=OS data comparison completed (%d/%d).
CMP_NAND=Comparing system/project data…(%d/%d)
CMP_NANDEND=System/Project data comparison completed (%d/%d).
CMP_SRAM=Comparing SRAM data…(%d/%d)
CMP_SRAMEND=SRAM data comparison completed (%d/%d).
CMP_END=Successfully completed.
CMP_ABOUT=Mismatch detected.
CMP_DIF_NOR=OS Core Data
CMP_DIF_SRAM=SRAM Data
CMP_DIF_SYSTEM=System Data
CMP_DIF_NPJ=NetWork Project
CMP_DIF_USER=User Data
CMP_DIF_FONT=Font Data
CMP_DIF_LOGIC=Logic Data
CMP_DIF_RUNTIME=Runtime Program
CMP_DIF_PROTOCOL=Protocol
CMP_DIF_EXTEND=Extended Program
CMP_DIF_CONTROL=Control Program
CMP_DIF_WEBSVR=WebServer Program
CMP_DIF_WFONT=Image Font File
CMP_DIF_SYSTEMSCR=System Screen Information
CMP_DIF_UNKNOWN=Unknown Data
MSG_RETURN=Please push the Back button.

[FolderSelect]
MemoryLoadTitle="Select Folder"
FolderFix="Current Folder Name:"
FolderName=""
ViewFileNameQ="File Name"
ViewSize="Size"
ViewTime="Time Stamp"
FreeSpaceOfCF="USBStorageFreeSpace:"
FreeSpaceOfCFQ="Free Space:"
CFFreeSpaceSize=""
CFkb="kbytes"
PagePrev=""
ViewTop="≪"
ViewUp="＜"
ViewDown="＞"
ViewBottom="≫"
PageBack=""
Enter="Enter"
Back="Back"

[CFUpLoading]
MemoryLoadTitle="Upload"
Coution="Warning: Data in the USB Storage will be lost."
CoutionQ1="Warning: "
CoutionQ2="Data in the USB Storage will be lost."
PathFix="Path Name:"
Path=""
FileFix="File Name:"
FileName=""
Back="Back"
Announce=""
Announce1=""
Announce2=""
Announce3=""
Announce4=""

[CFDownLoading]
MemoryLoadTitle="Download"
Coution="Warning: Data in the internal memory will be lost."
CoutionQ1="Warning: "
CoutionQ2="Data in the internal memory"
CoutionQ3="will be lost."
FileFix="File Name:"
Back="Back"
Announce=""
Announce1=""
Announce2=""
Announce3=""
Announce4=""
